Revit 2027 API
CoordinationModelLinkPathType Enumeration
 An enumerated type representing the options for the path type of a Coordination Model.
Namespace: Autodesk.Revit.DB.ExternalData
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum CoordinationModelLinkPathType
Public Enumeration CoordinationModelLinkPathType
public enum class CoordinationModelLinkPathType
type CoordinationModelLinkPathType
Members
Member name | Value | Description
Absolute | 0 |  The Coordination Model has a local absolute path on disk.
Cloud | 2 |  The Coordination Model has a cloud source path.
Relative | 1 |  The Coordination Model has a local relative path on disk.
See Also
Reference
Autodesk.Revit.DB.ExternalData Namespace